{"news_id": "184522", "effective_date": "2025-10-21 13:45:59", "category": "School Districts", "headline": "Clarkston School District Extends Deadline for School-Based Health Center Proposals", "detail": "&lt;p&gt;Clarkston, WA&amp;nbsp;&ndash;&amp;nbsp;Clarkston School District has extended the submission deadline for its Request for Proposals (RFP) seeking a qualified health care organization to establish and operate a School-Based Health Center (SBHC) on the Clarkston High School campus.&lt;br /&gt;\n&lt;br /&gt;\nThe SBHC will provide preventative and primary health care services to Clarkston students, with a strong emphasis on mental and behavioral health. This initiative is intended to reduce barriers to care, increase access for underserved youth, and support student success both inside and outside the classroom.&lt;br /&gt;\n&lt;br /&gt;\nThrough state and local grants, Clarkston School District has secured funding to construct the facility and is now seeking a health care partner to operate the center. Minimum service requirements include 10 hours per week of physical health care, 10 hours per week of mental and behavioral health care, and 15 hours per week of care coordination.&lt;br /&gt;\n&lt;br /&gt;\nInterested health care organizations must submit proposals by &lt;strong&gt;4:00 p.m. PT on Friday, October 31, 2025&lt;/strong&gt;. Complete RFP details, including application requirements, are available on the district&rsquo;s website:&amp;nbsp;&lt;a href=\"https://www.csdk12.org/page/school-based-health-center\" target=\"_new\"&gt;www.csdk12.org/page/school-based-health-center&lt;/a&gt;&lt;/p&gt;", "org": "Clarkston School District"}
{"news_id": "184642", "effective_date": "2025-10-28 07:32:01", "category": "Businesses", "headline": "Mazama Energy Unveils the World&rsquo;s Hottest Enhanced Geothermal System, Paving the Way for Affordable Clean Power on a Global Scale (Photo)", "detail": "&lt;p&gt;&lt;em&gt;Mazama Energy&rsquo;s technological innovations prove ideal for powering AI&lt;/em&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;DALLAS, October 28, 2025&lt;/strong&gt;&amp;nbsp;&ndash; &lt;a href=\"https://mazamaenergy.com/\"&gt;Mazama Energy, Inc.&lt;/a&gt;, a company incubated by Khosla Ventures and backed by Khosla Ventures and Gates Frontier, today announced a technologically significant leap for clean energy: the creation of the world&rsquo;s hottest Enhanced Geothermal System (EGS) at its pilot site in Newberry, Oregon &ndash; at an unprecedented 629 &deg;F (331 &deg;C) bottomhole temperature.&amp;nbsp; This breakthrough sets a new global benchmark for geothermal technology and marks a critical step towards delivering low-cost, carbon-free baseload power at terawatt-scale, targeting less than 5 cents per kilowatt-hour (kWh).&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;A New Era for Data Center Energy: Always-On, Anywhere, Carbon-Free&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;As data centers and AI workloads surge, the world faces an unprecedented demand for continuous, high-density power. Traditional renewables such as solar and wind are intermittent, while natural gas and coal are carbon intensive. By developing geothermal resources at temperatures above 300 &deg;C, Mazama can deliver power 24/7 from virtually anywhere in the world, regardless of weather or time of day. This makes Mazama&rsquo;s geothermal platform the ideal solution for hyperscale data centers and industrial electrification.&lt;/p&gt;\n\n&lt;p&gt;&ldquo;With geothermal, you get global, round-the-clock energy that is carbon-free, cost-stable, and grid-independent,&rdquo; said Sriram Vasantharajan, CEO of Mazama Energy. &ldquo;Our team&rsquo;s accomplishments expand the frontiers of geothermal power into significantly hotter and more heterogeneous rock regimes than ever before. The Newberry pilot provides a blueprint for unlocking baseload, utility-scale, carbon-free energy from the Earth&rsquo;s crust worldwide, which is what the next generation of AI and cloud infrastructure requires.&rdquo;&lt;/p&gt;\n\n&lt;p&gt;Dr. John McLennan, Reservoir Management Lead at Utah FORGE, said, &ldquo;This is a validation of an integrated development program that has successfully interconnected two slightly deviated wells and circulated a representative working fluid &ndash; a fulfillment of a vision from nearly fifty years ago to create a full scale EGS reservoir which was initiated by Los Alamos National Laboratory at Fenton Hill, New Mexico. This proof of concept opens the door to deeper and hotter opportunities at Newberry and beyond.&rdquo;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;Unlocking SuperHot Geothermal: Toward Terawatt-Scale Clean Energy&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Mazama will next advance to commercial projects with horizontal wells, beginning with a 15 MW pilot in 2026 and then scaling to a 200 MW development project at Newberry. The company will also extend its drilling into the SuperHot Rock regime (&amp;gt;400 &deg;C range), leveraging proprietary high-temperature materials, cooling solutions and stimulation technologies. Harnessing SuperHot Rock resources will allow Mazama to extract up to 10x more power density, use 75% less water and drill 80% fewer wells than current approaches.&amp;nbsp;Mazama aims to deliver terawatts of competitive and dispatchable power&amp;nbsp;globally.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;Located within the Cascade Range, Newberry is one of the largest geothermal reservoirs in the U.S. At the demonstration site, Mazama&rsquo;s engineers first completed and stimulated a legacy well to serve as the water injector.&amp;nbsp; Mazama then successfully drilled a new, 10,200-foot deviated producer well within six feet of its planned trajectory achieving optimal alignment with the injector. Initial circulation tests and diagnostics confirm comprehensive connectivity between the two wells and the creation of the hottest-ever EGS.&amp;nbsp;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;Mazama&rsquo;s team successfully deployed a spectrum of innovative technologies &ndash; including directional drilling, high-temperature well construction, and proprietary stimulation -- to deliver performance under conditions far beyond traditional oil and gas industry limits. The team operated year-round at a remote, high-altitude site, with zero lost-time incidents.&lt;/p&gt;\n\n&lt;p&gt;During the technical demonstration, Mazama achieved:&lt;/p&gt;\n\n&lt;ul&gt;\n     &lt;li&gt;Peak drill penetration rates of 100 feet/hour&lt;/li&gt;\n     &lt;li&gt;Average 76 feet/hour across diverse rock types: granite, basalt, and granodiorite&lt;/li&gt;\n     &lt;li&gt;Record-breaking bit runs up to 2,760 feet through volcanic formations&lt;/li&gt;\n     &lt;li&gt;Zero downhole failures of motors or measurement tools&lt;/li&gt;\n     &lt;li&gt;Well integrity and cement stability at ultra-high temperatures&lt;/li&gt;\n&lt;/ul&gt;\n\n&lt;p&gt;At the heart of this success is Mazama&rsquo;s proprietary Thermal Lattice&trade; stimulation, which is a patented process, purpose-built for enhanced geothermal environments.&amp;nbsp; Building on conventional hydraulic fracturing, Thermal Lattice&trade; enables complex fracture creation and improved connectivity. The Newberry project also demonstrated the successful use of crosslinked fracturing fluid systems, sliding sleeves, chemical and nano tracers, and fiber-optic diagnostics for real-time fracture mapping and temperature monitoring.&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;About Mazama Energy&lt;/strong&gt;&lt;/p&gt;\n\n&lt;p&gt;Mazama Energy is pioneering&amp;nbsp;Enhanced Geothermal Systems&amp;nbsp;and&amp;nbsp;SuperHot Rock technologies to deliver low-cost, dispatchable, and carbon-free power at a global scale. Through its proprietary&amp;nbsp;MUSE&trade; technology platform, Mazama is redefining geothermal performance and unlocking the world&rsquo;s largest untapped renewable resource deep heat from the Earth&rsquo;s crust.&lt;/p&gt;\n\n&lt;p&gt;For more information about Mazama, visit &lt;a href=\"http://www.mazamaenergy.com/\"&gt;www.mazamaenergy.com. &lt;/a&gt;&lt;/p&gt;", "org": "StingRay Communications"}
{"news_id": "184714", "effective_date": "2025-10-30 11:16:39", "category": "School Districts", "headline": "Clarkston School District&rsquo;s Donna Franklin Honored with National School Health Leadership Award (Photo)", "detail": "&lt;p&gt;Clarkston, WA &ndash; Clarkston School District is proud to announce that Donna Franklin, Director of Health Services, has been named the recipient of Cairn Guidance&rsquo;s 2025 School Health Leadership Award. This national honor recognizes exceptional leaders who prioritize the health and well-being of students and staff while advancing systems and practices that link health and education.&lt;br /&gt;\n&lt;br /&gt;\nFranklin&rsquo;s collaborative and visionary leadership has helped transform the district&rsquo;s approach to student wellness. Working alongside a dedicated team of staff and community partners, she has guided the implementation of barrier-removing strategies that promote student engagement and emotional well-being.&lt;br /&gt;\n&lt;br /&gt;\nUnder Franklin&rsquo;s leadership, and through strong collaboration with local healthcare providers and community organizations, the district has expanded access to student health resources. A key accomplishment includes the creation of a Wellness Center at Clarkston High School, where students can take a brief mental health break, re-center, and return to class ready to learn. Together with district and community partners, Franklin helped secure funding for a District School-Based Health Center. This milestone will further enhance the district&rsquo;s ability to support students&rsquo; physical and mental health needs.&lt;br /&gt;\n&lt;br /&gt;\nStudents have reported that the wellness supports have made a meaningful difference. One student shared,&amp;nbsp;&lt;em&gt;&ldquo;Being able to use a Wellness Pass when I need a mental break has been a big deal. I can now self-refer to the Wellness Center to calm down before an outburst or episode happens in class.&rdquo;&lt;/em&gt;&lt;br /&gt;\n&lt;br /&gt;\nFranklin&rsquo;s work has made a lasting impact across the Clarkston community. Cairn Guidance, a national organization that supports schools and communities in creating healthier learning environments, recognized Franklin for her commitment to equity, innovation, and the belief that every student deserves access to care and connection. You can learn more about Cairn Guidance&rsquo;s work and see their full feature on Donna Franklin on their &lt;a href=\"https://cairnguidance.com/blog/2025/10/celebrating-excellence-in-school-health-leadership-donna-franklin/\" target=\"_new\"&gt;blog&lt;/a&gt; and &lt;a href=\"https://cairnguidance.com/school-health-leadership-award/\" target=\"_new\"&gt;website&lt;/a&gt;, where they highlight how they support school health leaders across the country.&lt;br /&gt;\n&lt;br /&gt;\nClarkston School District is extremely proud of Donna&rsquo;s achievements and her leadership in building strong partnerships that support student wellness. Please join us in celebrating this well-deserved recognition of her exceptional leadership and service.&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;###&lt;/p&gt;", "org": "Clarkston School District"}
{"news_id": "185010", "effective_date": "2025-11-12 10:00:00", "category": "Organizations & Associations", "headline": "Murdock Trust announces science awards for students, faculty", "detail": "&lt;div class=\"OutlineElement Ltr SCXW157440042 BCX8\" style=\"-webkit-user-drag: none; -webkit-tap-highlight-color: transparent; margin: 0px; padding: 0px; user-select: text; clear: both; cursor: text; overflow: visible; position: relative; direction: ltr; font-family: &amp;quot;Segoe UI&amp;quot;, &amp;quot;Segoe UI Web&amp;quot;, Arial, Verdana, sans-serif; font-size: 12px; background-color: rgb(255, 255, 255);\"&gt;\n&lt;p&gt;&lt;span style=\"font-family:aptos,aptos_embeddedfont,aptos_msfontservice,sans-serif; font-size:12pt\"&gt;(Vancouver, WA) -- This past weekend, more than 400 students and faculty from Pacific Northwest, predominantly undergraduate institutions gathered to present and celebrate science research at the 34&lt;/span&gt;&lt;span style=\"font-family:aptos,aptos_embeddedfont,aptos_msfontservice,sans-serif; font-size:9.5pt\"&gt;th&lt;/span&gt;&lt;span style=\"font-family:aptos,aptos_embeddedfont,aptos_msfontservice,sans-serif; font-size:12pt\"&gt; annual Murdock College Science Research (MCSR) Conference. Hosted by the M.J. Murdock Charitable Trust, the conference focused on sharing and advancing new knowledge and celebrating student and faculty research.&amp;nbsp;&lt;/span&gt;&lt;span style=\"font-family:aptos,aptos_embeddedfont,aptos_msfontservice,sans-serif; font-size:12pt\"&gt;&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;/div&gt;\n\n&lt;div class=\"OutlineElement Ltr SCXW157440042 BCX8\" style=\"-webkit-user-drag: none; -webkit-tap-highlight-color: transparent; margin: 0px; padding: 0px; user-select: text; clear: both; cursor: text; overflow: visible; position: relative; direction: ltr; font-family: &amp;quot;Segoe UI&amp;quot;, &amp;quot;Segoe UI Web&amp;quot;, Arial, Verdana, sans-serif; font-size: 12px; background-color: rgb(255, 255, 255);\"&gt;\n&lt;p&gt;&lt;span style=\"font-family:aptos,aptos_embeddedfont,aptos_msfontservice,sans-serif; font-size:12pt\"&gt;The following faculty prizes were awarded: Greta Binford, Ph.D., Professor of Biology, Lewis and Clark College; and Christopher Whidbey, Ph.D., Associate Professor of Chemistry, Seattle University.&lt;/span&gt;&lt;span style=\"font-family:aptos,aptos_embeddedfont,aptos_msfontservice,sans-serif; font-size:12pt\"&gt;&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n&lt;/div&gt;\n\n&lt;div class=\"OutlineElement Ltr SCXW157440042 BCX8\" style=\"-webkit-user-drag: none; -webkit-tap-highlight-color: transparent; margin: 0px; padding: 0px; user-select: text; clear: both; cursor: text; overflow: visible; position: relative; direction: ltr; font-family: &amp;quot;Segoe UI&amp;quot;, &amp;quot;Segoe UI Web&amp;quot;, Arial, Verdana, sans-serif; font-size: 12px; background-color: rgb(255, 255, 255);\"&gt;\n&lt;p&gt;&lt;span style=\"font-family:aptos,aptos_embeddedfont,aptos_msfontservice,sans-serif; font-size:12pt\"&gt;Students were also awarded prizes for poster (12) and oral (2) presentations. Student winners were from Carroll College, Gonzaga University, Northwest Nazarene University, Pacific Lutheran University, Reed College, Seattle University, University of Alaska Anchorage, University of Portland, University of Puget Sound, Western Washington University, Whitworth University, and Willamette University.&lt;/span&gt;&lt;span style=\"font-family:aptos,aptos_embeddedfont,aptos_msfontservice,sans-serif; font-size:12pt\"&gt;&amp;nbsp;&lt;/span&gt;&lt;/p&gt;\n\n&lt;p&gt;&amp;nbsp;&lt;/p&gt;\n\n&lt;p&gt;&lt;span style=\"font-family:aptos,aptos_embeddedfont,aptos_msfontservice,sans-serif; font-size:12pt\"&gt;A full list of awards and winners &lt;a href=\"https://murdocktrust.org/2025/11/murdock-college-science-research-mcsr-conference-2025\"&gt;available here&lt;/a&gt;.&lt;/span&gt;&lt;/p&gt;\n&lt;/div&gt;", "org": "M.J. Murdock Charitable Trust"}
{"news_id": "185100", "effective_date": "2025-11-17 14:51:36", "category": "Federal", "headline": "Group Press Releases Covering the Time Period of Shutdown (Photo)", "detail": "&lt;p&gt;&lt;span style=\"font-family:times new roman,times,serif\"&gt;Good afternoon,&lt;/span&gt;&lt;/p&gt;\n\n&lt;p&gt;&lt;span style=\"font-family:times new roman,times,serif\"&gt;We are happy to be through the shutdown so we can again share newsworthy cases being handled by our office.&amp;nbsp; Since we were not able to share these during the shutdown, we have compiled group press releases on noteworthy cases with links to the full press releases if you would like to review additional details on any given case.&amp;nbsp; There are three categories of press releases highlighting a total of 19 separate cases/investigations: (1) Transnational Drug Trafficking and Weapons Offenses; (2) Violent Crime and Child Exploitation cases; and (3) Fraud, Waste and Abuse cases.&amp;nbsp; Like many federal employees across the Nation, the dedicated public servants at the United States Attorney&rsquo;s Office continued to work without pay throughout the shutdown to ensure the ongoing protection of the community.&amp;nbsp; As these cases show, the USAO has continued to obtain excellent results that have kept people safe from drugs and guns, child exploitation, and fraud, among other offenses.&amp;nbsp; Please feel free to reach out with any questions.&amp;nbsp; Thank you.&amp;nbsp;&lt;/span&gt;&lt;/p&gt;", "org": "U.S. Attorney's Office - Eastern Dist. of Wash."}
